nxp-mcuxpresso/mcux-soc-svd/MCXA557/MCXA557.xml
        <register>
          <name>P2IRULESTAT</name>
          <description>Set Interrupt Rules and User Status</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x600000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USTAT</name>
              <description>User-Defined Status Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERR</name>
              <description>Interrupt If Error Detected</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTRD</name>
              <description>Interrupt If Read or First Read or Bus Master Started</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTWR</name>
              <description>Interrupt If Write or First Write or Bus Master Finished</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTSPC</name>
              <description>Select Interrupts for PnSTAT[INTSPC0] through PnSTAT[INSTSPC3]</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSTCL</name>
              <description>Status Set and Clear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SRST</name>
              <description>Reset PnSTAT[RDSTAT] and PnSTAT[WRSTAT]</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FLASH_COMPLETION_TYPE</name>
              <description>Flash Completion Type</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIDDLE</name>
                  <description>Indicates the middle completion of a split completion sequence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRST</name>
                  <description>Indicates the first completion of a split completion sequence</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAST</name>
                  <description>Indicates the last completion of a split completion sequence</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONLY</name>
                  <description>Indicates the only completion for a split transaction.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU_TAG</name>
              <description>CPU Tag</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2ADDR</name>
          <description>Port Address</description>
          <alternateGroup>PADDR</alternateGroup>
          <addressOffset>0x14C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OFF</name>
              <description>Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BASE_ASZ</name>
              <description>The meaning is dependent on type of port:</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET_FROM_0</name>
                  <description>Offset from 0 in host memory or I/O space.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BASE0</name>
                  <description>Uses BASE0 offset in host memory</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BASE1</name>
                  <description>Uses BASE1 offset in host memory</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDXOFF</name>
              <description>Index Offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDX1ST</name>
              <description>For index-and-data register only:</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dataoff</name>
                  <description>Index is higher address than data (for example, data at OFF, index at OFF+IDXOFF)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>idxoff</name>
                  <description>Index is lower address than data (for example, index at OFF, data at OFF+IDXOFF)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>P2OMFLEN</name>
          <description>Port OOB, Mastering, and Flash Length</description>
          <alternateGroup>POMFLEN</alternateGroup>
          <addressOffset>0x14C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEN</name>
              <description>Length in Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRANS</name>
              <description>Transfer Request</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>oob</name>
                  <description>OOB: to host; Master: to host 32 (host reads with 32-bit address); SAF: Completion fail</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read</name>
                  <description>Master: to host 64 (host reads w/64-bit address); MAF: read flash (location in RAM); SAF: completion with data</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>write</name>
                  <description>Master: from host 32 (host writes w/32-bit address); MAF: write flash (location in RAM); SAF: completion with no data</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>erase</name>
                  <description>Master: from host 64 (host writes w/64-bit address); MAF: erase flash (sector in RAM)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>P2DATAIN</name>
          <description>Port Data Input</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_LEN</name>
              <description>Data Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIR</name>
              <description>Direction of last access</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Read by host</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Write by host</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDX</name>
              <description>Index of Last Access</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2DATAOUT</name>
          <description>Port Data Out</description>
          <alternateGroup>PDATAOUT</alternateGroup>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data to Send to Host</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P2RAMUSE</name>
          <description>Port RAM Use</description>
          <alternateGroup>PRAMUSE</alternateGroup>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OFF</name>
              <description>Offset into RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEN</name>
              <description>Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P3CFG</name>
          <description>Port Configuration</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TYPE</name>
              <description>Interaction Type between Port and Host</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNCONFIGURED</name>
                  <description>Unconfigured (reset condition)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACPI_END</name>
                  <description>ACPI style Endpoint</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACPI_INDEX</name>
                  <description>ACPI style index-and-data. Index and data byte locations. Index gives offset into implied space. Uses registers for data and index.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUS_M_MEM_S</name>
                  <description>Bus Master Memory Single</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUS_M_FLASH_S</name>
                  <description>Bus Master Flash Single</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAILBOX_SHARED</name>
                  <description>Mailbox Shared</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAILBOX_SINGLE</name>
                  <description>Mailbox Single</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAILBOX_SPLIT</name>
                  <description>Mailbox Split</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAILBOX_OOB_SPLIT</name>
                  <description>Mailbox OOB Split</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAILBOX_OEM</name>
                  <description>Mailbox OEM</description>
                  <value>0xC</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIRECTION</name>
              <description>Port Direction</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dir0</name>
                  <description>Endpoint or index-and-data: bidirectional (normal). Mailbox Single: unenforced. Mailbox Split or Mailbox Shared: bidirectional.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dir1</name>
                  <description>Endpoint or index-and-data: ignore read. Mailbox Single: write only. Mailbox Split or Mailbox Shared: ignore read.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dir2</name>
                  <description>Endpoint or index-and-data: ignore write. Mailbox Single: read only. Mailbox Split or Mailbox Shared: ignore write.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dir3</name>
                  <description>Endpoint or index-and-data: Ignore both. Mailbox Single: ignore both. Mailbox Split or Mailbox Shared: ignore both.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBINTALL</name>
              <description>Mailbox: map interrupt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALLRD</name>
              <description>Stall on any read</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALLWR</name>
              <description>Stall on write</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRORIGN</name>
              <description>Error Origin</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>errorigin0</name>
                  <description>The host receives an error when trying to perform a read or write that is blocked by PnCFG[DIRECTION].</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>errorigin1</name>
                  <description>Ignored silently. Reads return FFh for each byte if ignored (host property). In either case, PnSTAT[INTERR] bit becomes 1, causing an interrupt if masked for it.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
