nxp-mcuxpresso/mcux-soc-svd/MCXA557/MCXA557.xml
        <register>
          <name>MRCC_LPSPI1_CLKDIV</name>
          <description>LPSPI1 clock divider control</description>
          <addressOffset>0x1C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Functional Clock Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>Reset divider counter</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Divider isn't reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Divider is reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALT</name>
              <description>Halt divider counter</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Divider clock is running</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Divider clock is stopped</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNSTAB</name>
              <description>Divider status flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Divider clock is stable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Clock frequency isn't stable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MRCC_I3C2_FCLK_CLKSEL</name>
          <description>I3C2_FCLK clock selection control</description>
          <addressOffset>0x1C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX</name>
              <description>Functional Clock Mux Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>i0_clkroot_func_0</name>
                  <description>FRO_LF_DIV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i2_clkroot_func_2</name>
                  <description>FRO_HF_DIV</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i3_clkroot_func_3</name>
                  <description>CLK_IN</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i5_clkroot_func_5</name>
                  <description>CLK_1M</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i6_clkroot_func_6</name>
                  <description>PLL1_CLK_DIV</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MRCC_I3C2_FCLK_CLKDIV</name>
          <description>I3C2_FCLK clock divider control</description>
          <addressOffset>0x1CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Functional Clock Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>Reset divider counter</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Divider isn't reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Divider is reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALT</name>
              <description>Halt divider counter</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Divider clock is running</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Divider clock is stopped</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNSTAB</name>
              <description>Divider status flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Divider clock is stable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Clock frequency isn't stable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MRCC_LPUART0_CLKSEL</name>
          <description>LPUART0 clock selection control</description>
          <addressOffset>0x1D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX</name>
              <description>Functional Clock Mux Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>i0_clkroot_sirc_div</name>
                  <description>FRO_LF_DIV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i2_clkroot_firc_div</name>
                  <description>FRO_HF_DIV</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i3_clkroot_sosc</name>
                  <description>CLK_IN</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i4_clkroot_lposc</name>
                  <description>LP_OSC</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i5_clkroot_1m</name>
                  <description>CLK_1M</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i6_clkroot_spll_div</name>
                  <description>PLL1_CLK_DIV</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MRCC_LPUART0_CLKDIV</name>
          <description>LPUART0 clock divider control</description>
          <addressOffset>0x1D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Functional Clock Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>Reset divider counter</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Divider isn't reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Divider is reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALT</name>
              <description>Halt divider counter</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Divider clock is running</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Divider clock is stopped</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNSTAB</name>
              <description>Divider status flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Divider clock is stable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Clock frequency isn't stable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MRCC_LPUART1_CLKSEL</name>
          <description>LPUART1 clock selection control</description>
          <addressOffset>0x1D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX</name>
              <description>Functional Clock Mux Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>i0_clkroot_sirc_div</name>
                  <description>FRO_LF_DIV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i2_clkroot_firc_div</name>
                  <description>FRO_HF_DIV</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i3_clkroot_sosc</name>
                  <description>CLK_IN</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i4_clkroot_lposc</name>
                  <description>LP_OSC</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i5_clkroot_1m</name>
                  <description>CLK_1M</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i6_clkroot_spll_div</name>
                  <description>PLL1_CLK_DIV</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MRCC_LPUART1_CLKDIV</name>
          <description>LPUART1 clock divider control</description>
          <addressOffset>0x1DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Functional Clock Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>Reset divider counter</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Divider isn't reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Divider is reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALT</name>
              <description>Halt divider counter</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Divider clock is running</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Divider clock is stopped</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNSTAB</name>
              <description>Divider status flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Divider clock is stable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Clock frequency isn't stable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MRCC_LPUART2_CLKSEL</name>
          <description>LPUART2 clock selection control</description>
          <addressOffset>0x1E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX</name>
              <description>Functional Clock Mux Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>i0_clkroot_sirc_div</name>
                  <description>FRO_LF_DIV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i2_clkroot_firc_div</name>
                  <description>FRO_HF_DIV</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i3_clkroot_sosc</name>
                  <description>CLK_IN</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i4_clkroot_lposc</name>
                  <description>LP_OSC</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i5_clkroot_1m</name>
                  <description>CLK_1M</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i6_clkroot_spll_div</name>
                  <description>PLL1_CLK_DIV</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MRCC_LPUART2_CLKDIV</name>
          <description>LPUART2 clock divider control</description>
          <addressOffset>0x1E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Functional Clock Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>Reset divider counter</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Divider isn't reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Divider is reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALT</name>
              <description>Halt divider counter</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Divider clock is running</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Divider clock is stopped</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNSTAB</name>
              <description>Divider status flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Divider clock is stable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Clock frequency isn't stable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MRCC_LPUART3_CLKSEL</name>
          <description>LPUART3 clock selection control</description>
          <addressOffset>0x1E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX</name>
              <description>Functional Clock Mux Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>i0_clkroot_sirc_div</name>
                  <description>FRO_LF_DIV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i2_clkroot_firc_div</name>
                  <description>FRO_HF_DIV</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i3_clkroot_sosc</name>
                  <description>CLK_IN</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i4_clkroot_lposc</name>
                  <description>LP_OSC</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i5_clkroot_1m</name>
                  <description>CLK_1M</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i6_clkroot_spll_div</name>
                  <description>PLL1_CLK_DIV</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
